Jacky-zhengH/stm32Practice_SPL/5.1_对射式红外传感器计次/Hardware/CountSensor.c
#include "stm32f10x.h"                  // Device header
uint16_t CountSensor_count;
void CountSensor_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
    GPIO_InitTypeDef GPIOInstructer;
    GPIOInstructer.GPIO_Mode=GPIO_Mode_IPD;
    GPIOInstructer.GPIO_Pin=GPIO_Pin_14;
    GPIOInstructer.GPIO_Speed=GPIO_Speed_50MHz;
    GPIO_Init(GPIOB,&GPIOInstructer);
    
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOB,GPIO_PinSource14);
    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_InitStructure.EXTI_Line=EXTI_Line14;
    EXTI_InitStructure.EXTI_LineCmd=ENABLE;
    EXTI_InitStructure.EXTI_Mode=EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger=EXTI_Trigger_Falling;
    EXTI_Init(&EXTI_InitStructure);
    
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    NVIC_InitTypeDef NVIC_InitStruct;
    NVIC_InitStruct.NVIC_IRQChannel=EXTI15_10_IRQn;
    NVIC_InitStruct.NVIC_IRQChannelCmd=ENABLE;
    NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority=1;
    NVIC_InitStruct.NVIC_IRQChannelSubPriority=1;
    NVIC_Init(&NVIC_InitStruct);
}

uint16_t CountSensor_countGet(void)
{
    return CountSensor_count;
}

void EXTI15_10_IRQHandler(void)
{
     if(EXTI_GetITStatus(EXTI_Line14) == SET)
    {
        CountSensor_count++;
        EXTI_ClearITPendingBit(EXTI_Line14);
    }
}
